[
    {
        "title": "Pokemon Sanctuary",
        "event": "GreatUniHack 2021",
        "content": [
            "Our task was to create something which followed a \"nuclear fallout\" theme.",
            "We created a game using the Pygame module in Python. The idea of the game was that you would catch Pokemon in this dangerous, post-apocalyptic world which is littered with hazards that can harm the player. The code was fully commented and met PEP8 styling guidelines.",
            "My team received a special mention for the quality of the finished application - which was effectively a top five prize out of 26 entries."
        ],
        "github": "https://github.com/Hive-Worker-Bees/PokemonSanctuary"
    },
    {
        "title": "Journey Planner",
        "event": "Tameside Hack: Summer 2019",
        "content": [
            "Our task was to build a website which helps a user plan their travel.",
            "We created an ExpressJS web server to render a calendar which the users could use to add their events, including the start and end point and times. A separate Python server would then use this data to determine how to get there and when to set off (not included in the demo linked below).",
            "My team won the challenge prize - which including a work experience day with Purple WiFi." 
        ],
        "github": "https://github.com/Naeviant/Hackathon-Sum-19",
        "website": "https://sum19.hackathons.hirst.me"
    },
    {
        "title": "The Online Store of 2068",
        "event": "Tameside Hack: Autumn 2018",
        "content": [
            "Our task was to create an online shop for Brother (the challenge sponsors) for products which may be sold in 2068.",
            "We created an ExpressJS web server to track the items which a user has added to their basket. The available products were displayed in a tidy front end which used the Bootstrap framework.",
            "My team won the Best in Show award at the Hackathon."
        ],
        "github": "https://github.com/Naeviant/Hackathon-Aut-18",
        "website": "https://aut18.hackathons.hirst.me"
    },
    {
        "title": "Day Planner",
        "event": "Tameside Hack: Summer 2018",
        "content": [
            "Our task was to create a program to generate a day out for a user.",
            "We created a static HTML website which made requests to a Python web server. The website was then able to render the content received in the responses. The application also featured a questionnaire to make the results more relevant to the user. Currently, the data served is static.",
            "We created a visually-appealing application which made a good proof of concept."
        ],
        "github": "https://github.com/Naeviant/Hackathon-Sum-18"
    },
    {
        "title": "Raspberry Pi Sensors",
        "event": "Tameside Hack: Summer 2017",
        "content": [
            "Our task was to do something using a Raspberry Pi and various sensors located around the building.",
            "We created a Python script to monitor the sensors and report any concerns via a graphical user interface. The areas measured including temperature, noise and more.",
            "My team won the challenge prize which included our own Raspberry Pis."
        ]
    }
]