[
    {
        "title": "hirst.xyz",
        "intro": "My own personal website for my online portfolio.",
        "status": "Maintained",
        "start": "November 2018",
        "end": "Present",
        "repo": "https://github.com/Naeviant/MyWebsite",
        "showcase": "https://hirst.xyz",
        "description": "The aim of this website was to create a landing page for my domain. I wanted to use it to give a brief introduction to myself and what I do, as well as showcasing my projects. Hopefully this will be a good reference point in future which I can show to people when introducing some of my past work.",
        "review": "This project was relatively straight forward. The hardest part was getting a format which I liked. I wanted to try a system where there is no loading or page refreshing - only smooth transitions between pages. While this wasn't as easy, I'm happy with how it's turned out.",
        "languages": ["HTML", "CSS", "Bootstrap", "JavaScript", "NodeJS", "Express", "JQuery"]
    },
    {
        "title": "Cards",
        "intro": "A \"Higher or Lower\" cards game, which provides statistics of the best choice to make.",
        "status": "Maintained",
        "start": "August 2019",
        "end": "Present",
        "repo": "https://github.com/Naeviant/Cards",
        "showcase": "https://cards.hirst.xyz",
        "description": "This was intended to be a quick project. I had never really made a game before and wanted to create something fun rather than serious. After making this and publishing it, I found it really addictive and played it quite a lot.",
        "review": "This was not intended to be a challenging project and so I had very little difficulty in putting it together. I am not aware of any bugs in this project, so I am very happy with the result.",
        "languages": ["HTML", "CSS", "Materialize", "JavaScript", "NodeJS", "Express", "JQuery"]
    },
    {
        "title": "RotaIt",
        "intro": "A rota creation tool designed to add features to the tool used at my workplace.",
        "status": "Deprecated",
        "start": "April 2019",
        "end": "July 2019",
        "repo": "https://github.com/Naeviant/RotaIt-Management",
        "description": "As part of my Computer Science A-Level, I was required to undertake a coding project. I chose to create this rota tool. It is made up of a management system for managers to manage staff and create rotas, and also a client system for staff to view rotas and view their information.",
        "review": "The project scored well, which I believe shows that it was a success. There are, however, lots of bugs related to some base parts of the code. I therefore feel that further development would require a full restart, and so this project is no longer maintained. I may revisit it at a later date.",
        "languages": ["HTML", "CSS", "Materialize", "JavaScript", "NodeJS", "Express", "JQuery", "MongoDB"]
    },
    {
        "title": "The Hat",
        "intro": "A \"names out of a hat\" randomiser.",
        "status": "Maintained",
        "start": "August 2020",
        "end": "Present",
        "repo": "https://github.com/Naeviant/The-Hat",
        "description": "The Hat is a program that was around when I was very young. Having looked at it again more recently, I was shocked to discovered it was now generally flagged as malware and was no longer available. So I decided to remake it. The program works by writing a list of names to go in the hat, and then drawing them one by one.",
        "review": "Although I had used the Windows Forms framework before, I had never used C# or any other C langauge before. I am pleased that I was able to put something working together, although of course I will need to undertake something more complex to have a solid understanding of the language.",
        "languages": ["C#", "Windows Forms"]
    },
    {
        "title": "Assistant",
        "intro": "A program designed to track various school-related things for myself.",
        "status": "Deprecated",
        "start": "August 2020",
        "end": "Present",
        "repo": "https://github.com/Naeviant/Assistant",
        "description": "This project was intended to help me organise things for school - most notably homework. It offers a clean interface to input records related to homework, which are then displayed in a table. This table can then be filtered by any field, downloaded as a CSV and more.",
        "review": "Although listed here as being started in August 2020, this project is actually much older. Variations of this application were among the first ones that I made. The version now available is somewhat remastered, but still contains imperfections that are a sign of my experience at the time.",
        "languages": ["VB.net", "Windows Forms"]
    },
    {
        "title": "ToDo List",
        "intro": "A simple to do list application.",
        "status": "Maintained",
        "start": "August 2020",
        "end": "Present",
        "repo": "https://github.com/Naeviant/ToDo",
        "showcase": "https://todo.hirst.xyz",
        "description": "This project is a simple todo list. You can add as many items as you like, and then cross then off as you go using a checkbox. When you're done with a todo and wish to remove it from the list, there is a button to do so.",
        "review": "This project began on a work experience day I completed in Purple WiFi where we were walked through how to do this by two employees. One year later, I have recreated this independently using extra features - such as the addition of local storage to save the todos.",
        "languages": ["HTML", "CSS", "JavaScript", "ReactJS"]
    },
    {
        "title": "Tameside Hackathon - October 2018",
        "intro": "A website to showcase products made by Brother UK in 2068.",
        "status": "Deprecated",
        "start": "October 2018",
        "end": "October 2018",
        "repo": "https://github.com/Naeviant/Hackathon-18",
        "showcase": "https://hack18.hirst.xyz",
        "description": "This was an entry to a Hackathon competition. Our task was to create a Brother product in the year 2068 and present it in a creative way. The purpose of this website was to fulfil the latter part of the brief. Even though it won us \"Best in Show\", it wasn't quite enough to give us a win for the task!",
        "review": "Although this is unfinished due to time limitations, I'm happy with how it turned out. It was the first time I had properly used Bootstrap's CSS libraries, which caused the odd problem here and there. Sadly it just wasn't a winner on this occassion!",
        "languages": ["HTML", "CSS", "Bootstrap", "JavaScript", "NodeJS", "Express", "JQuery"]
    },
    {
        "title": "Koda",
        "intro": "Koda is a personal Discord bot. It's not built to do anything particularly special - just to be a bit of fun.",
        "status": "Maintained",
        "start": "Janurary 2019",
        "end": "Present",
        "repo": "https://github.com/Naeviant/Koda",
        "showcase": "https://koda.hirst.xyz",
        "description": "This project was intended to be a bot for a specific college server. I wanted it to have some of the games which I have included in past bots I have created, as well as some additional functions such as reminders. It was also designed to have a strong access levels system.",
        "review": "I think it could still do with some more features which people usually like on Discord servers. For example, music services are popular - as well as commands which make use of APIs to embed images and audio. So far though, I'd say this is a fun and useful system.",
        "languages": ["HTML", "CSS", "Bootstrap", "JavaScript", "NodeJS", "Express", "Discord.js"]
    },
    {
        "title": "Tameside Hackathon - February 2019",
        "intro": "A calendar which can plan out how to get to a place and at what point you should set off.",
        "status": "Deprecated",
        "start": "February 2019",
        "end": "February 2019",
        "repo": "https://github.com/Naeviant/Hackathon-19",
        "showcase": "https://hack19.hirst.xyz",
        "description": "This was an entry to a Hackathon competition. Our task was to create something which used API data to improve daily life. So, we made use of Google's API libraries to create a calendar which can calculate how soon in advance you should set off and how to get there. It will also send SMS notifications 15 minutes before the user needs to set off. Unfortunately, this, and the system to add new events are disabled in the showcase.",
        "review": "Although this is not as polished as I would like due to time restrictions, I am happy with how this turned out. Assuming that the system is not abused, I have not come across any bugs with the system. It also won us the challenge so I think that says enough about it!",
        "languages": ["HTML", "CSS", "Bootstrap", "JavaScript", "NodeJS", "Express", "JQuery"]
    }
]